#pragma once
#include <cstddef>
#include <cstdint>

/**
 * @brief Быстрая сортировка (Quick Sort).
 *
 * Выбирает опорный элемент и расставляет числа так, чтобы числа меньше
 * были слева, а больше или равно справа. Рекурсивно повторяет алгоритм
 * для левой и правой части, получая на выходе отсортированный массив
 *
 * Время:
 * Лучший - O(n log n)
 * Средний - O(n log n)
 * Худший - O(n^2), при постоянном выборе наибольшего элемента как опорного
 *
 * Память (глубина стека реукрсии):
 * Лучший - O(log n)
 * Средний - O(log n)
 * Худший - O(n)
 *
 * @note Не усточивая. Использует разбиение Хоара
 *
 * @param l Указатель на первый элемент диапазона
 * @param r Указатель на элемент за последним
 */
void QuickSort(std::int32_t* l, std::int32_t* r);

/**
 * @brief Быстрый выбор (Quick Select)
 *
 * Находит элемент, который стоял бы на позиции nth, если бы диапазон был
 * отсортирован по возрастанию. Выбирает опорный элемент и расставляет числа
 * так, чтобы числа меньше были слева, а больше или равно справа (разбиение Хоара)
 * и продолжает поиск только в той части, где находится nth
 *
 * Время:
 * Лучший - O(n)
 * Средний - O(n)
 * Худший - O(n^2), при постоянном выборе наибольшего элемента как опорного
 *
 * Память (глубина стека реукрсии):
 * Лучший - O(1)
 * Средний - O(log n)
 * Худший - O(n)
 *
 * @note Изменяет исходный диапазон, создавая частичный порядок вокруг искомой
 *       позиции
 *
 * @param l   Указатель на первый элемент диапазона
 * @param r   Указатель на элемент за последним
 * @param nth Индекс искомого элемента в отсортированном порядке
 *
 * @return Значение элемента, который стоял бы на позиции nth
 *         в отсортированном диапазоне
 */
std::int32_t QuickSelect(std::int32_t* l, std::int32_t* r, std::size_t nth);

/**
 * @brief Сортировка слиянием (Merge Sort)
 *
 * Делит диапазон пополам, принимает, что левая и правая части отсортированы
 * (для массива из одного элемента это так), проходится по левой и правой
 * части и вставляет во вспомогательный массив меньший элемент, таким
 * образом получаем отсортированный массив
 *
 * Так же считает количество инверсий в массиве (количество пар (i, j),
 * где i < j и A[i] > A[j])
 *
 * Допустим возьмём серединный элемент. Если менять местами только элементы
 * слева, то количество инверсий не изменится, поэтому мы можем отсортировать
 * массив слева, найти первый элемент больше серединного элемента и посчитать
 * расстояние от него до серединного. Так как все элементы дальше
 * гарантированно больше серединного (массив отсортирован), то получим число
 * инверсий для этого элемента
 *
 * В сортировке слиянием левый подмассив как раз отсортирован, поэтому если
 * элемент из правого меньше элемента из левого (то есть его очередь попасть
 * во вспомогательный массив), то увеличиваем количество инверсий на
 * расстояние от элемента левого до середины (то есть до конца левого массива).
 * Так как правым элементом будет каждый элемент кроме первого и правый
 * подмассив мы тоже сортируем, то количество инверсий для элемента будет
 * подсчитано ровно один раз и мы можем просто сложить количество инверсий
 *
 * Время:
 * Лучший - O(n log n)
 * Средний - O(n log n)
 * Худший - O(n log n)
 *
 * Память:
 * Лучший - O(n)
 * Средний - O(n)
 * Худший - O(n)
 *
 * @note Устойчивая. При равенстве при слиянии берётся элемент из левой
 *       половины, то есть тот, который был в исходном массиве первым
 *
 * @param l Указатель на первый элемент диапазона
 * @param r Указатель на элемент за последним
 *
 * @return Количество инверсий исходного массива, то есть количество
 *         пар (i, j), где i < j и A[i] > A[j]
 */
std::int64_t MergeSort(std::int32_t* l, std::int32_t* r);

/**
 * @brief Сортировка подсчётом (Counting Sort)
 *
 * Создаёт вспомогательный массив размера диапазона значений элементов,
 * считает сколько раз число встречается в массиве, увеличивая счётчик
 * по индексу, беря значение числа как индекс. Дальше для каждого числа
 * составляет префиксную сумму - количество чисел, идущих до этого числа.
 * Создаёт второй вспомогательный массив размера n, проходится по исходному
 * массиву с конца и вставляет этот элемент во вспомогательный массив по
 * индексу, беря индекс как число элементов до него. Получается, что элемент
 * встаёт на своё последнее место
 *
 * Время (k - диапазон значений):
 * Лучший - O(n + k)
 * Средний - O(n + k)
 * Худший - O(n + k)
 *
 * Память (k - диапазон значений):
 * Лучший - O(n + k)
 * Средний - O(n + k)
 * Худший - O(n + k)
 *
 * @note Устойчивая. Исходный массив обходится справа налево, чтобы равные
 *       элементы, вставая на своё последнее место сохранили исходный порядок
 *
 * @param l Указатель на первый элемент диапазона
 * @param r Указатель на элемент за последним
 */
void CountingSort(std::int32_t* l, std::int32_t* r);

/**
 * @brief Поразрядная сортировка LSD (Least Significant Digit Radix Sort)
 *
 * Сортирует числа по разрядам, начиная с младшего. На каждом проходе
 * используется сортировка подсчётом, оптимизированная под байты (сортировка
 * по четырём байтам, с мощностью алфавита в 256 значений)
 *
 * Время:
 * Лучший - O(n)
 * Средний - O(n)
 * Худший - O(n)
 *
 * Память:
 * Лучший - O(n)
 * Средний - O(n)
 * Худший - O(n)
 *
 * @note Устойчивая, так как сортировка подсчётом устойчива на каждом
 *       проходе - именно это обеспечивает корректность LSD
 *
 * @param l Указатель на первый элемент диапазона
 * @param r Указатель на элемент за последним
 */
void LSDRadixSort(std::int32_t* l, std::int32_t* r);

/**
 * @brief Сортировка вставками (Insertion Sort)
 *
 * Принимает, что левая часть уже отсортирована (для массива из одного элемента
 * это так), берёт элемент справа и ищет ему место в отсортированной левой
 * части
 *
 * Время:
 * Лучший - O(n)
 * Средний - O(n^2)
 * Худший - O(n^2)
 *
 * Память:
 * Лучший - O(1)
 * Средний - O(1)
 * Худший - O(1)
 *
 * @note Устойчивая. При равенстве правый элемент всегда встаёт после
 *
 * @param l Указатель на первый элемент диапазона
 * @param r Указатель на элемент за последним
 */
void InsertionSort(std::int32_t* l, std::int32_t* r);

/**
 * @brief Сортировка выбором (Selection Sort)
 *
 * Находит минимальный элемент из правой части и вставляет его в конец
 * левой части
 *
 * Время:
 * Лучший - O(n^2)
 * Средний - O(n^2)
 * Худший - O(n^2)
 *
 * Память:
 * Лучший - O(1)
 * Средний - O(1)
 * Худший - O(1)
 *
 * @note Устойчивая (в этой реализации). Находится первый минимальный
 *       элемент, все элементы от текущей позиции до него сдвигаются
 *       вправо на одну позицию, а минимум вставляется на освободившееся
 *       место. Обычный обмен (swap) сделал бы сортировку нестабильной
 *
 * @param l Указатель на первый элемент диапазона
 * @param r Указатель на элемент за последним
 */
void SelectionSort(std::int32_t* l, std::int32_t* r);
